In [1]:
import pandas as pd
import numpy as np
import matplotlib as mpl
from sklearn.linear_model import LogisticRegression
from sklearn.linear_model import LinearRegression
from sklearn.tree import DecisionTreeClassifier
import matplotlib.pyplot as plt
from datetime import datetime

1. 데이터 다운로드

In [4]:
origin_data = pd.read_csv("ID-8.txt", sep="\t", header=None)

In [7]:
origin_data.head()

   0   1   2   3   4   5   6   7     8    9   10  11  12  13  14
0   1   4  40   1   2   5   1   1  3150  1.0   0   0   2   2   4
1   1   4  56   1   2   5   1   1  3636  1.0   0   0   2   2   4
2   1   2  40   1   1   5   1   3   450  1.0   0   0   2   2   4
3   1   2  41   2   1   5   1   2   420  1.0   0   0   2   2   4
4   1   4  37   1   2   6   1   1  5640  1.0   0   0   1   2   6

In [8]:
origin_data.columns = ['location', 'hosusehold_size', 'age', 'sex','maristat', 'school','school2', 'worktype', 'wage', 'jobtype', 'englishtime','english','union' ,'certi', 'ysrsshl']

In [9]:
origin_data.head()

,location,hosusehold_size,age,sex,maristat,school,school2,worktype,wage,jobtype,englishtime,english,union,certi,ysrsshl
0,1,4,40,1,2,5,1,1,3150,1.0,0,0,2,2,4
1,1,4,56,1,2,5,1,1,3636,1.0,0,0,2,2,4
2,1,2,40,1,1,5,1,3,450,1.0,0,0,2,2,4
3,1,2,41,2,1,5,1,2,420,1.0,0,0,2,2,4
4,1,4,37,1,2,6,1,1,5640,1.0,0,0,1,2,6

2. 전치리

In [10]:
origin_data.isna().sum()

location           0
hosusehold_size    0
age                0
sex                0
maristat           0
school             0
school2            0
worktype           0
wage               0
jobtype            1
englishtime        0
english            0
union              0
certi              0
ysrsshl            0
dtype: int64

In [11]:
origin_data.dropna(inplace=True)

In [28]:
origin_data['sex'][origin_data['sex'] == 2] = list(np.zeros(len(origin_data[origin_data['sex'] == 2])))

C:\Users\Popperkim\AppData\Local\Temp\ipykernel_16720\4202413216.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  origin_data['sex'][origin_data['sex'] == 2] = list(np.zeros(len(origin_data[origin_data['sex'] == 2])))

In [29]:
origin_data.head()

,location,hosusehold_size,age,sex,maristat,school,school2,worktype,wage,jobtype,englishtime,english,union,certi,ysrsshl
0,1,4,40,1.0,2,5,1,1,3150,1.0,0,0,2,2,4
1,1,4,56,1.0,2,5,1,1,3636,1.0,0,0,2,2,4
2,1,2,40,1.0,1,5,1,3,450,1.0,0,0,2,2,4
3,1,2,41,0.0,1,5,1,2,420,1.0,0,0,2,2,4
4,1,4,37,1.0,2,6,1,1,5640,1.0,0,0,1,2,6